Documents/ОтборРазмещениеТоваровBabochka.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ОтборРазмещениеТоваровBabochka</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗонаОтгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейкиBabochka</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийОтбораРазмещенияТоваровBabochka</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗонаПриемки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеЯчейкиBabochka</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Распоряжение</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОтборовРазмещенийТоваровBabochka</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаНачалаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаОкончанияВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЭтоРезерв</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаявкаНаПеремещение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаПеремещение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТоварыОтбор</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Ячейка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладскиеЯчейкиBabochka</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НеОтображатьДвижения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТоварыРазмещение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Ячейка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладскиеЯчейкиBabochka</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ОтборРазмещениеТоваровBabochka/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем КэшированныеЗначения; //используется механизмом обработки изменения реквизитов ТЧ

&НаКлиенте
Перем ТекущиеДанныеИдентификатор; //используется для передачи текущей строки в обработчик ожидания

&НаКлиенте
Перем ПараметрыДляЗаписи Экспорт;

#КонецОбласти

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);

	Если Параметры.Ключ.Пустая() Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.Статус) Тогда
			Объект.Статус = Перечисления.СтатусыОтборовРазмещенийТоваровBabochka.Подготовлено;	
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(Объект.Распоряжение) 
			И НЕ ЗначениеЗаполнено(Объект.ВидОперации) Тогда    
			
			Если ТипЗнч(Объект.Распоряжение) = Тип("ДокументСсылка.ПриходныйОрдерНаТовары") 
				ИЛИ ТипЗнч(Объект.Распоряжение) = Тип("ДокументСсылка.ОприходованиеИзлишковТоваров") Тогда
				 Объект.ВидОперации = Перечисления.ВидыОперацийОтбораРазмещенияТоваровBabochka.Размещение;
			 ИначеЕсли ТипЗнч(Объект.Распоряжение) = Тип("ДокументСсылка.РасходныйОрдерНаТовары")
				 ИЛИ ТипЗнч(Объект.Распоряжение) = Тип("ДокументСсылка.СписаниеНедостачТоваров") 
				 ИЛИ ТипЗнч(Объект.Распоряжение) = Тип("ДокументСсылка.ЗаявкаНаПеремещение") Тогда 
				 Объект.ВидОперации = Перечисления.ВидыОперацийОтбораРазмещенияТоваровBabochka.Отбор;
			 Иначе
				 Объект.ВидОперации = Перечисления.ВидыОперацийОтбораРазмещенияТоваровBabochka.Перемещение;
			 КонецЕсли;
			 
		Иначе
			Если НЕ ЗначениеЗаполнено(Объект.ВидОперации) Тогда
				Объект.ВидОперации = Перечисления.ВидыОперацийОтбораРазмещенияТоваровBabochka.Размещение;	
			КонецЕсли;
		КонецЕсли; 
		
		Объект.Ответственный = Пользователи.ТекущийПользователь();
		Объект.ДатаНачалаВыполнения = ТекущаяДатаСеанса();
		
	КонецЕсли;  
	
	Элементы.ВосстановитьРезерв.Видимость = Объект.ЭтоРезерв;	
	
	УстановитьУсловноеОформление();
	
	Если НЕ Параметры.Ключ.Пустая() Тогда
		ЗаполнитьИспользованиеХарактеристик();
	КонецЕсли;
	
	Если НЕ Параметры.Ключ.Пустая() 
		И Объект.Статус = Перечисления.СтатусыОтборовРазмещенийТоваровBabochka.Выполнено 
		И НЕ РольДоступна("ПолныеПрава") Тогда
		УстановитьДоступностьЭлементов(Истина);
	КонецЕсли;
	
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма, "Товары");

	// СтандартныеПодсистемы.ПодключаемыеКоманды 
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект); 
	//ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, , "ТоварыРазмещение"); 
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды    
	
КонецПроцедуры

&НаСервере
Функция УстановитьДоступностьЭлементов(Запрет = Истина)
	      	
	Элементы.ТоварыРазмещение.ТолькоПросмотр = Запрет;//ДоступностьЭлементов;		
	Элементы.ТоварыОтбор.ТолькоПросмотр 	 = Запрет;		
	Элементы.ЗаполнитьЯчейкиРасход.Доступность = НЕ Запрет;
	Элементы.ТоварыРазмещениеЗаполнитьЯчейки.Доступность = НЕ Запрет;
	Элементы.ТоварыОтборУстановитьЯчейкуОтбор.Доступность = НЕ Запрет;
		     	
КонецФункции

Функция ЗаполнитьИспользованиеХарактеристик()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧРазмещение.Номенклатура КАК Номенклатура1
		|ПОМЕСТИТЬ ВТ_ТоварыРазмещение
		|ИЗ
		|	&ТЧРазмещение КАК ТЧРазмещение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЧ_Отбор.Номенклатура КАК Номенклатура1
		|ПОМЕСТИТЬ ВТ_Отбор
		|ИЗ
		|	&ТЧ_Отбор КАК ТЧ_Отбор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ВТ_ТоварыРазмещение.Номенклатура1 КАК Справочник.Номенклатура).ИспользованиеХарактеристик КАК ИспользованиеХарактеристик,
		|	ВТ_ТоварыРазмещение.Номенклатура1 КАК Номенклатура
		|ИЗ
		|	ВТ_ТоварыРазмещение КАК ВТ_ТоварыРазмещение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫРАЗИТЬ(ВТ_Отбор.Номенклатура1 КАК Справочник.Номенклатура).ИспользованиеХарактеристик,
		|	ВТ_Отбор.Номенклатура1
		|ИЗ
		|	ВТ_Отбор КАК ВТ_Отбор";
	
	Запрос.УстановитьПараметр("ТЧ_Отбор", Объект.ТоварыОтбор.Выгрузить(,"Номенклатура"));
	Запрос.УстановитьПараметр("ТЧРазмещение", Объект.ТоварыРазмещение.Выгрузить(,"Номенклатура"));
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрокаТЧ Из Объект.ТоварыОтбор Цикл
		НайденнаяСтрока = ТЗ.Найти(СтрокаТЧ.Номенклатура, "Номенклатура");
		Если НайденнаяСтрока <> Неопределено Тогда
			СтрокаТЧ.ИспользованиеХарактеристик = НайденнаяСтрока.ИспользованиеХарактеристик;	
		КонецЕсли;
	КонецЦикла;
	Для каждого СтрокаТЧ Из Объект.ТоварыРазмещение Цикл
		НайденнаяСтрока = ТЗ.Найти(СтрокаТЧ.Номенклатура, "Номенклатура");
		Если НайденнаяСтрока <> Неопределено Тогда
			СтрокаТЧ.ИспользованиеХарактеристик = НайденнаяСтрока.ИспользованиеХарактеристик;	
		КонецЕсли;
	КонецЦикла;

КонецФункции

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ПодключаемыеКоманды 
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект); 
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьЭлементов(); 
	Если Параметры.Ключ.Пустая()
		И ЗначениеЗаполнено(Объект.Распоряжение)
		И ТипЗнч(Объект.Распоряжение) <> Тип("ДокументСсылка.ИнвентаризацияАдресногоСклада") 
		И НЕ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийОтбораРазмещенияТоваровBabochka.СнятиеСРезерва") Тогда   
		ЗаполнитьЯчейкиНаСервере(Истина);
		ЗаполнитьЯчейкиНаСервере(Ложь);
	КонецЕсли;  
	
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтаФорма, "СканерШтрихкода");
	//
	// СтандартныеПодсистемы.ПодключаемыеКоманды 
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект); 
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды      
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
		
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" И МенеджерОборудованияУТКлиент.ЕстьНеобработанноеСобытие() Тогда
			ОбработатьШтрихкоды(МенеджерОборудованияУТКлиент.ПреобразоватьДанныеСоСканераВМассив(Параметр));
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаСервере
Процедура НоменклатураПриИзмененииСервер(КэшированныеЗначения)
	
	ТекущаяСтрока = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	СтруктураДействийСТекущейСтрокой = Новый Структура;
	СтруктураДействийСТекущейСтрокой.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
	СтруктураДействийСТекущейСтрокой.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	СтруктураДействийСТекущейСтрокой.Вставить("ПроверитьХарактеристикуПоВладельцу", ТекущаяСтрока.Характеристика);
	СтруктураДействийСТекущейСтрокой.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", ТекущаяСтрока.Упаковка);
	СтруктураДействийСТекущейСтрокой.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействийСТекущейСтрокой.Вставить("НоменклатураПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
		ЭтаФорма.ИмяФормы, "Товары"));
	
	УпаковочныеЛистыСервер.НоменклатураУпаковочныйЛистПриИзменении(ЭтаФорма, Объект.Товары,
		"ТоварыНоменклатура", КэшированныеЗначения, СтруктураДействийСТекущейСтрокой);
		
		
КонецПроцедуры

// СтандартныеПодсистемы.Печать 
&НаКлиенте 
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда) 
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Объект); 
КонецПроцедуры 

&НаКлиенте 
Процедура Подключаемый_ВыполнитьКоманду(Команда) 
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект); 
КонецПроцедуры 

&НаСервере 
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат); 
КонецПроцедуры 
&НаКлиенте 
Процедура Подключаемый_ОбновитьКоманды() 
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект); 
КонецПроцедуры 
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Функция УстановитьВидимостьЭлементов()
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийОтбораРазмещенияТоваровBabochka.Перемещение") Тогда
		
		Элементы.ЗонаОтгрузки.Видимость = Ложь;
		Элементы.ЗонаПриемки.Видимость = Ложь;
		Элементы.ГруппаТоварыОтбор.Видимость = Истина;
		Элементы.ГруппаТоварыРазмещение.Видимость = Истина;
		
		Объект.ЗонаОтгрузки = Неопределено;
		Объект.ЗонаПриемки = Неопределено;
		Элементы.ТоварыРазмещениеПеренестиИзОтбора.Видимость = Истина;
	
		Возврат 0;
		
	КонецЕсли;
	
	ЭтоРазмещение = Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийОтбораРазмещенияТоваровBabochka.Размещение")
				ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийОтбораРазмещенияТоваровBabochka.СнятиеСРезерва");
	
	Элементы.ЗонаОтгрузки.Видимость = НЕ ЭтоРазмещение;
	Элементы.ЗонаПриемки.Видимость = ЭтоРазмещение;
	Элементы.ГруппаТоварыОтбор.Видимость = НЕ ЭтоРазмещение;
	Элементы.ГруппаТоварыРазмещение.Видимость = ЭтоРазмещение;
	Элементы.ГруппаТоварыОстатки.Видимость = Ложь;
	Элементы.ТоварыРазмещениеПеренестиИзОтбора.Видимость = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Объект.Распоряжение) Тогда
		
		Элементы.ЗонаОтгрузки.Видимость = Ложь;
		Элементы.ЗонаПриемки.Видимость = Ложь;
			
	КонецЕсли;

	Возврат 1;
	
КонецФункции

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент) 
	
	УстановитьВидимостьЭлементов(); 
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийОтбораРазмещенияТоваровBabochka.Отбор") Тогда
		Объект.ТоварыРазмещение.Очистить();
		Объект.ЗонаПриемки = Неопределено;	
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийОтбораРазмещенияТоваровBabochka.Размещение") Тогда
		Объект.ТоварыОтбор.Очистить(); 
		Объект.ЗонаОтгрузки = Неопределено;
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийОтбораРазмещенияТоваровBabochka.Перемещение") Тогда
		Объект.ТоварыОтбор.Очистить();
		Объект.ТоварыРазмещение.Очистить();  
		Объект.Распоряжение = Неопределено;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЯчейкиНаСервере(ЭтоПриход = Истина) 
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	Результат = ДокументОбъект.ЗаполнитьЯчейки(ЭтоПриход);
	Если Результат.Товары <> Неопределено Тогда 
		Если ЭтоПриход Тогда
			Объект["ТоварыРазмещение"].Загрузить(Результат.Товары);
		Иначе
			Объект["ТоварыОтбор"].Загрузить(Результат.Товары); 
			
			//чтобы снимать каждую отдельную строку в резерве
			Если Объект.ЭтоРезерв Тогда
				Для каждого СтрокаТЧ Из Объект.ТоварыОтбор Цикл
					Если СтрокаТЧ.Количество > 1 Тогда   
						КоличествоРазбить = СтрокаТЧ.Количество;
						СтрокаТЧ.Количество = 1;
						КоличествоРазбить = КоличествоРазбить - 1;
						Пока КоличествоРазбить > 0 Цикл
							НоваяСтрока = Объект.ТоварыОтбор.Добавить();
							ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
							НоваяСтрока.Количество = 1;
							КоличествоРазбить = КоличествоРазбить - 1;
						КонецЦикла;
					КонецЕсли;		
				КонецЦикла;	
			КонецЕсли;
		КонецЕсли;
		Если Результат.МассивОшибок.Количество() Тогда
			Для каждого СтрокаОшибка Из Результат.МассивОшибок Цикл
				Сообщить(СтрокаОшибка);	
			КонецЦикла;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЯчейки(Команда)  
	
	ОчиститьСообщения();
	ЗаполнитьЯчейкиНаСервере();    
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыОтборовРазмещенийТоваровBabochka.Выполнено") Тогда
		Объект.ДатаОкончанияВыполнения = ТекущаяДатаСеанса();
	Иначе
		Объект.ДатаОкончанияВыполнения = Дата(1,1,1);
	КонецЕсли;  
	
	Если НЕ Параметры.Ключ.Пустая() 
		И Объект.Статус <> ПредопределенноеЗначение("Перечисление.СтатусыОтборовРазмещенийТоваровBabochka.Выполнено") Тогда
		
		ЕстьДвиженияПослеДокумента = ВыполнитьПроверкуНаИзменениеСтатуса();
		Если ЕстьДвиженияПослеДокумента Тогда
			Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыОтборовРазмещенийТоваровBabochka.Выполнено");   
			ТекстСообщения = "Нельзя изменить статус документа.
							 |Для изменения статуса сначала распроведите все документы после него."; 
			ПоказатьПредупреждение(,ТекстСообщения,,"BABOCHKA"); 
		Иначе
			УстановитьДоступностьЭлементов(Ложь);
		КонецЕсли;
	Иначе
		УстановитьДоступностьЭлементов(Ложь);  	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьПроверкуНаИзменениеСтатуса()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиВЯчейкахОбороты.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрНакопления.ОстаткиВЯчейках.Обороты(, , Регистратор, ) КАК ОстаткиВЯчейкахОбороты
		|ГДЕ
		|	ОстаткиВЯчейкахОбороты.Регистратор = &Регистратор";
	
	Запрос.УстановитьПараметр("Регистратор", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ЕстьДвиженияПослеДокумента = АдресноеХранениеBabochka.ВыполнитьПроверкуЕстьДвиженияПослеДокумента(Объект.Ссылка, Ложь);
	
		Возврат ЕстьДвиженияПослеДокумента;
			
	КонецЕсли;	
	             
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьЯчейкиРасход(Команда)    
	
	ЗаполнитьЯчейкиНаСервере(Ложь);     
	
КонецПроцедуры

Функция ПеренестиИзОтбораНаСервере()
	
	Объект.ТоварыРазмещение.Очистить();
	
	Для каждого СтрокаТЧ Из Объект.ТоварыОтбор Цикл
		СтрокаНовая = Объект.ТоварыРазмещение.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНовая, СтрокаТЧ,,"Ячейка");
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура ПеренестиИзОтбора(Команда)
	
	 ПеренестиИзОтбораНаСервере();
	
КонецПроцедуры


&НаКлиенте
Процедура ТоварыРазмещениеНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТоварыРазмещение.ТекущиеДанные; 
	Если ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		
		ТекущиеДанные.ИспользованиеХарактеристик = ИспользованиеХарактеристик(ТекущиеДанные.Номенклатура)
		
	КонецЕсли;
	

КонецПроцедуры

&НаСервереБезКонтекста
Функция ИспользованиеХарактеристик(Номенклатура)
	Возврат Номенклатура.ИспользованиеХарактеристик;
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
    // Оформление: цвет фона – зеленая лужайка.

	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "<характеристики не используются>");
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
    ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.СветлоСерый);
    
    ЭлементУсловия = ЭлементУО.Отбор.Элементы. Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ТоварыРазмещение.ИспользованиеХарактеристик");
    ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    ЭлементУсловия.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать");

	// Оформляемое поле: товар в табличной части.
    ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
    ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТоварыРазмещениеХарактеристика");
	
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
    // Оформление: цвет фона – зеленая лужайка.

	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", "<характеристики не используются>");
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Доступность", Ложь);
    ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.СветлоСерый);
    
    ЭлементУсловия = ЭлементУО.Отбор.Элементы. Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ТоварыОтбор.ИспользованиеХарактеристик");
    ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    ЭлементУсловия.ПравоеЗначение = ПредопределенноеЗначение("Перечисление.ВариантыИспользованияХарактеристикНоменклатуры.НеИспользовать");

	// Оформляемое поле: товар в табличной части.
    ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
    ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТоварыОтборХарактеристика");

КонецПроцедуры

  
  
&НаКлиенте
Процедура ТоварыОтборНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТоварыОтбор.ТекущиеДанные; 
	Если ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда
		
		ТекущиеДанные.ИспользованиеХарактеристик = ИспользованиеХарактеристик(ТекущиеДанные.Номенклатура)
		
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы) 
	
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтаФорма);

КонецПроцедуры  

&НаКлиенте
Процедура ЗагрузитьДанныеИзТСД(Команда)
	
	МенеджерОборудованияКлиент.НачатьЗагрузкуДанныеИзТСД(
		Новый ОписаниеОповещения("ЗагрузитьИзТСДЗавершение", ЭтотОбъект),
		УникальныйИдентификатор);
		
	ЗаполнитьИспользованиеХарактеристик();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзТСДЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если РезультатВыполнения.Результат Тогда
		ОбработатьШтрихкоды(РезультатВыполнения.ТаблицаТоваров);
	Иначе
		МенеджерОборудованияУТКлиент.СообщитьОбОшибке(РезультатВыполнения);
	КонецЕсли;
	
КонецПроцедуры

#Область ШтрихкодыИТорговоеОборудование

&НаКлиенте
Процедура ОбработатьШтрихкоды(ДанныеШтрихкодов)
	
	СтруктураДействийСДобавленнымиСтроками = Новый Структура;
	СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(ЭтотОбъект, СтруктураДействийСДобавленнымиСтроками);
	
	СтруктураДействийСИзмененнымиСтроками = Новый Структура;
	//СтруктураДействийСИзмененнымиСтроками.Вставить("ЗаполнитьПризнакТовМестаТребуетсяОбработка");
	//СтруктураДействийСИзмененнымиСтроками.Вставить("ПересчитатьВесОбъем");
	
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(ЭтотОбъект, СтруктураДействийСИзмененнымиСтроками);

	СтруктураДействийСоСтрокамиИзУпаковочныхЛистов = Новый Структура;
	
	СтруктураДействийСоСтрокамиИзУпаковочныхЛистов.Вставить("ЗаполнитьПризнакХарактеристикиИспользуются",
		Новый Структура("Номенклатура", "ХарактеристикиИспользуются"));
	СтруктураДействийСоСтрокамиИзУпаковочныхЛистов.Вставить("ЗаполнитьПризнакТипНоменклатуры",
		Новый Структура("Номенклатура", "ТипНоменклатуры"));
	СтруктураДействийСоСтрокамиИзУпаковочныхЛистов.Вставить("ЗаполнитьПризнакАртикул",
		Новый Структура("Номенклатура", "Артикул"));
		
	
	СтруктураДействий = ШтрихкодированиеНоменклатурыКлиент.ПараметрыОбработкиШтрихкодов();

	СтруктураДействий.Штрихкоды                              = ДанныеШтрихкодов;
	СтруктураДействий.СтруктураДействийСДобавленнымиСтроками = СтруктураДействийСДобавленнымиСтроками;
	СтруктураДействий.СтруктураДействийСИзмененнымиСтроками  = СтруктураДействийСИзмененнымиСтроками;
	СтруктураДействий.ТолькоТовары                           = Истина;
	СтруктураДействий.ШтрихкодыВТЧ                           = Истина;
	СтруктураДействий.УчитыватьУпаковочныеЛисты              = ИспользоватьУпаковочныеЛисты;
	СтруктураДействий.ДействияСНеизвестнымиШтрихкодами       = "НетДействий";
	СтруктураДействий.СтруктураДействийСоСтрокамиИзУпаковочныхЛистов = СтруктураДействийСоСтрокамиИзУпаковочныхЛистов;
	СтруктураДействий.ОтработатьИзменениеУпаковочныхЛистов   = Истина;

	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийОтбораРазмещенияТоваровBabochka.Размещение") Тогда
		СтруктураДействий.ИмяТЧ = "ТоварыРазмещение";
	Иначе
		СтруктураДействий.ИмяТЧ = "ТоварыОтбор";
	КонецЕсли;   
	
	//СтруктураДействий.Вставить("ПроверитьАссортиментСтроки", Ложь);
	
	ОбработатьШтрихкодыСервер(СтруктураДействий,КэшированныеЗначения);
	
	ШтрихкодированиеНоменклатурыКлиент.ОбработатьНеизвестныеШтрихкоды(СтруктураДействий,КэшированныеЗначения,ЭтаФорма);
	
	Если СтруктураДействий.ТекущаяСтрока <> Неопределено Тогда
		
		Элементы[СтруктураДействий.ИмяТЧ].ТекущаяСтрока = СтруктураДействий.ТекущаяСтрока;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(Форма, Действия)
	
	Действия.Вставить("ПересчитатьКоличествоЕдиниц");
	Действия.Вставить("ПересчитатьВесОбъем");
		
КонецФункции

&НаСервере
Процедура ОбработатьШтрихкодыСервер(СтруктураДействий,КэшированныеЗначения)
	
	ШтрихкодированиеНоменклатурыСервер.ОбработатьШтрихкоды(ЭтаФорма,Объект,СтруктураДействий,КэшированныеЗначения);
	
	Если СтруктураДействий.ТекущаяСтрока <> Неопределено Тогда
		СтруктураДействийСТекущейСтрокой = Новый Структура;
		СтруктураДействийСТекущейСтрокой.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
		СтруктураДействийСТекущейСтрокой.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
		
		ТекущаяСтрока = Объект[СтруктураДействий.ИмяТЧ].НайтиПоИдентификатору(СтруктураДействий.ТекущаяСтрока);
		
		ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействийСТекущейСтрокой, КэшированныеЗначения);
	КонецЕсли;
	
			
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПоискПоШтрихкодуВыполнить(Команда)
	
	ОчиститьСообщения();
	Оповещение = Новый ОписаниеОповещения("ПоискПоШтрихкодуЗавершение", ЭтотОбъект);
	ШтрихкодированиеНоменклатурыКлиент.ПоказатьВводШтрихкода(Оповещение);
	
КонецПроцедуры    

&НаКлиенте
Процедура ПоискПоШтрихкодуЗавершение(ДанныхШтрихкода, ДополнительныеПараметры) Экспорт
	
	ОбработатьШтрихкоды(ДанныхШтрихкода);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработатьЗаписьОбъекта()
	
	ОбщегоНазначенияУТКлиент.ОбработатьЗаписьОбъектаВФорме(ЭтотОбъект, ПараметрыДляЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

// ИнтеграцияС1СДокументооборотом
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуИнтеграции(Команда)
	
	ИнтеграцияС1СДокументооборотКлиент.ВыполнитьПодключаемуюКомандуИнтеграции(Команда, ЭтаФорма, Объект);
	
КонецПроцедуры
// Конец ИнтеграцияС1СДокументооборотом

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры


&НаКлиенте
Процедура Подключаемый_ЗакрытьФорму()
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЯчейку(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Склад", Объект.Склад);
	
	ОткрытьФорму("Документ.ОтборРазмещениеТоваровBabochka.Форма.ФормаУстановкиЯчейки", 
				ПараметрыОткрытия,
				ЭтаФорма,
				ЭтаФорма.УникальныйИдентификатор,,,
				Новый ОписаниеОповещения("ОбработатьВыборЗначения", ЭтаФорма, ),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	

КонецПроцедуры

&НаКлиенте
Функция ОбработатьВыборЗначения(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		Если НЕ Результат.Свойство("Ячейка") Тогда
			Возврат Неопределено;	
		КонецЕсли; 
		
		Ячейка = Результат.Ячейка;
		
		Для каждого ИндексСтроки Из Элементы.ТоварыРазмещение.ВыделенныеСтроки Цикл
			Объект.ТоварыРазмещение[ИндексСтроки].Ячейка = Ячейка;	
		КонецЦикла; 
		
	КонецЕсли; 
	
КонецФункции

&НаКлиенте
Процедура УстановитьЯчейкуОтбор(Команда)

	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Склад", Объект.Склад);
	
	ОткрытьФорму("Документ.ОтборРазмещениеТоваровBabochka.Форма.ФормаУстановкиЯчейки", 
				ПараметрыОткрытия,
				ЭтаФорма,
				ЭтаФорма.УникальныйИдентификатор,,,
				Новый ОписаниеОповещения("ОбработатьВыборЗначенияОтбор", ЭтаФорма, ),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Функция ОбработатьВыборЗначенияОтбор(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		Если НЕ Результат.Свойство("Ячейка") Тогда
			Возврат Неопределено;	
		КонецЕсли; 
		
		Ячейка = Результат.Ячейка;
		
		Для каждого ИндексСтроки Из Элементы.ТоварыРазмещение.ВыделенныеСтроки Цикл
			Объект.ТоварыОтбор[ИндексСтроки].Ячейка = Ячейка;	
		КонецЦикла; 
		
	КонецЕсли; 
	
КонецФункции

&НаКлиенте
 Процедура ПроверкаКоличества(Команда)
	 
	 ПараметрыОткрытия = Новый Структура();
	 ПараметрыОткрытия.Вставить("ТЗ_Документа", ПоместитьВХранилище());
	 ПараметрыОткрытия.Вставить("СсылкаОтбор", Объект.Ссылка);
	 
	 ОткрытьФорму("Обработка.ПроверкаКоличестваТоваровВОтборе.Форма", 
				ПараметрыОткрытия,
				ЭтаФорма,
				ЭтаФорма.УникальныйИдентификатор,,,
				Новый ОписаниеОповещения("ОбработатьВыборЗначений", ЭтаФорма, ),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	 
 КонецПроцедуры
 
&НаСервере
Функция ПоместитьВХранилище()
	Возврат ПоместитьВоВременноеХранилище(Объект.ТоварыОтбор.Выгрузить(), ЭтаФорма.УникальныйИдентификатор)	
КонецФункции

 &НаКлиенте
Функция ОбработатьВыборЗначений(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		
	КонецЕсли; 
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьОстаткиПоЯчейке(Команда)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Склад", Объект.Склад);
	
	ОткрытьФорму("Документ.ОтборРазмещениеТоваровBabochka.Форма.ФормаЗаполнениеОстатковЯчейки", 
				ПараметрыОткрытия,
				ЭтаФорма,
				ЭтаФорма.УникальныйИдентификатор,,,
				Новый ОписаниеОповещения("ЗаполнитьОстаткиПоЯчейкеОбработкаВыбора", ЭтаФорма, ),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Функция ЗаполнитьОстаткиПоЯчейкеОбработкаВыбора(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		Если НЕ Результат.Свойство("Ячейка") Тогда
			Возврат Неопределено;	
		КонецЕсли; 
		
		Ячейка = Результат.Ячейка;
		
		ЗаполнитьОстатки(Ячейка);
		
	КонецЕсли; 

	Возврат Неопределено;
	
КонецФункции

&НаСервере
Функция ЗаполнитьОстатки(Ячейка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыВЯчейкахBabochkaОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыВЯчейкахBabochkaОстатки.Характеристика КАК Характеристика,
		|	ТоварыВЯчейкахBabochkaОстатки.Ячейка КАК Ячейка,
		|	ТоварыВЯчейкахBabochkaОстатки.ВНаличииОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.ТоварыВЯчейкахBabochka.Остатки(, Ячейка = &Ячейка) КАК ТоварыВЯчейкахBabochkaОстатки
		|ГДЕ
		|	ТоварыВЯчейкахBabochkaОстатки.ВНаличииОстаток > 0";
	
	Запрос.УстановитьПараметр("Ячейка", Ячейка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл  
		
		СтрокаТЧ = Объект.ТоварыОтбор.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, Выборка);
			
	КонецЦикла;	  
	
КонецФункции


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.Статус <> ПредопределенноеЗначение("Перечисление.СтатусыОтборовРазмещенийТоваровBabochka.Выполнено") Тогда
		Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыОтборовРазмещенийТоваровBabochka.Выполнено");
	КонецЕсли;
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение
		И Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийОтбораРазмещенияТоваровBabochka.СнятиеСРезерва") 
		И НЕ РазрешеноРедактирование() Тогда      
		Отказ = Истина;
		ПоказатьПредупреждение(,"Пользователю запрещено снимать с резерва", 10);
	КонецЕсли;
	
	Если НачалоДня(Объект.Дата) <> НачалоДня(ТекущаяДатаСеанса())
		И ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение
		И НЕ РазрешеноПроведениеЗаднимЧислом() Тогда
		
		Отказ = Истина;
		ПоказатьПредупреждение(,"Пользователю запрещено проводить документы задним числом", 10);
	
	КонецЕсли;
	
	Если НЕ ДоступныПолныеПрава() 
		И НЕ Объект.Проведен
		И ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Объект.Дата = ТекущаяДатаСеанса();
		
	КонецЕсли;  
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДоступныПолныеПрава()   
	
	Возврат РольДоступна("ПолныеПрава");
	
КонецФункции

&НаСервереБезКонтекста
Функция РазрешеноПроведениеЗаднимЧислом()   
	
	Возврат РольДоступна("РазрешеноПроведениеОтбораЗаднимЧисломАдресноеХранение") ИЛИ РольДоступна("ПолныеПрава");
	
КонецФункции

&НаСервереБезКонтекста
Функция РазрешеноРедактирование()     
	
	Возврат РольДоступна("РазрешеноСниматьСРезерваАдресноеХранение") ИЛИ РольДоступна("ПолныеПрава");
	
КонецФункции

&НаКлиенте
Процедура ВосстановитьДвиженияРезерва(Команда)
	
	ОткрытьФорму("Документ.ОтборРазмещениеТоваровBabochka.Форма.ФормаВводаПароля", 
				,
				ЭтаФорма,
				ЭтаФорма.УникальныйИдентификатор,,,
				Новый ОписаниеОповещения("ОбработатьВводПароляИВосстановитьДвижения", ЭтаФорма, ),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Функция ОбработатьВводПароляИВосстановитьДвижения(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено 
		И Результат.Свойство("ПарольВерен") 
		И Результат.ПарольВерен Тогда
		
		Для каждого СтрокаТЧ Из Объект.ТоварыОтбор Цикл
			СтрокаТЧ.НеОтображатьДвижения = Ложь;	
		КонецЦикла; 
		
		Модифицированность = Истина;
	КонецЕсли; 
	
КонецФункции

&НаКлиенте
Процедура УпорядочитьПоНоменклатуре(Команда)
	
	УпорядочитьНоменклатуруНаСервере();
		
КонецПроцедуры

&НаСервере
Процедура УпорядочитьНоменклатуруНаСервере()
	
	ЭтотОбъект.Объект.ТоварыОтбор.Сортировать("Ячейка, Номенклатура, Характеристика");
	
КонецПроцедуры

&НаСервере
Процедура УпорядочитьРазмещениеНаСервере() 
	
	ЭтотОбъект.Объект.ТоварыРазмещение.Сортировать("Ячейка, Номенклатура, Характеристика");
	
КонецПроцедуры

&НаКлиенте
Процедура УпорядочитьРазмещение(Команда)
	УпорядочитьРазмещениеНаСервере();
КонецПроцедуры
